Revit 2027 API
ElectricalAnalyticalNode.GetUpstreamNodeIds Method
 Gets upstream node ids.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetUpstreamNodeIds()
Public Function GetUpstreamNodeIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetUpstreamNodeIds()
member GetUpstreamNodeIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The array of upstream node ids.
Remarks
 If node B supplies from node A, node B is the downstream node of node A, and node A is the upstream node of node B. Usually one node only has one upstream node, but TransferSwitch may have two upstream nodes.
See Also
Reference
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace